In [2]:
data = {
  'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'], 
  'Age': [25, 30, 35, 40, 45], 
  'Department': ['HR', 'IT', 'Finance', 'Marketing', 'Operations']
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(data)

In [5]:
df

      Name  Age  Department
0    Alice   25          HR
1      Bob   30          IT
2  Charlie   35     Finance
3    David   40   Marketing
4      Eve   45  Operations

### Retrieve the row of the DataFrame where the Name is 'Charlie'.

In [6]:
charlie_data = df[df['Name'] == 'Charlie']

In [7]:
charlie_data

      Name  Age Department
2  Charlie   35    Finance

### Select all the rows where the Age is greater than 30 using loc